cf/Reports/SalesReportTORG29.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>SalesReportTORG29</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReportNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StartDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EndDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

cf/Reports/SalesReportTORG29/Forms/ReportForm/Ext/Form/Module.bsl
// Procedure - command handler "SetInterval".
//
&AtClient
Procedure SetInterval(Command)
	
	Dialog = New StandardPeriodEditDialog();
	
	Dialog.Period.StartDate    = Report.StartDate;
	Dialog.Period.EndDate = Report.EndDate;
	
	Dialog.Show(New NotifyDescription("SetIntervalEnd", ThisObject, New Structure("Dialog", Dialog)));
	
EndProcedure

&AtClient
Procedure SetIntervalEnd(Result1, AdditionalParameters) Export
	
	Dialog = AdditionalParameters.Dialog;
	
	If ValueIsFilled(Result1) Then
		
		Report.StartDate    = Dialog.Period.StartDate;
		Report.EndDate = Dialog.Period.EndDate;
		
	EndIf;
	
EndProcedure // SetInterval()

// Procedure - form event handler "OnOpen".
//
&AtClient
Procedure OnOpen(Cancel)
	
	If Not ValueIsFilled(Report.StartDate) AND Not ValueIsFilled(Report.EndDate) Then
		
		Report.StartDate    = BegOfYear(CurrentDate());
		Report.EndDate = CurrentDate();
		
	EndIf;
	
EndProcedure // OnOpen()

// Procedure fills report fields by values if they are not filled.
//
&AtServer
Procedure FillValuesByDefault(Settings)
	
	If Not ValueIsFilled(Settings.Get("Report.Company")) Then
		
		SettingValue = SmallBusinessReUse.GetValueByDefaultUser(Users.CurrentUser(), "MainCompany");
		If ValueIsFilled(SettingValue) Then
			Report.Company = SettingValue;
		Else
			Report.Company = Catalogs.Companies.MainCompany;		
		EndIf;
		
	EndIf;
	
	If Not ValueIsFilled(Settings.Get("Report.StructuralUnit")) Then
		
		SettingValue = SmallBusinessReUse.GetValueByDefaultUser(Users.CurrentUser(), "MainWarehouse");
		If ValueIsFilled(SettingValue) Then
			Report.StructuralUnit = SettingValue;
		Else
			Report.StructuralUnit = Catalogs.StructuralUnits.MainWarehouse;	
		EndIf;
		
	EndIf;
	
EndProcedure // FillByValuesDefault()

// Procedure - form event handler "OnLoadDataFromSettingsAtServer".
//
&AtServer
Procedure OnLoadDataFromSettingsAtServer(Settings)
	
	FillValuesByDefault(Settings);
	
EndProcedure // OnLoadDataFromSettingsAtServer()

&AtServer
Procedure OnSaveUserSettingsAtServer(Settings)
	ReportsVariants.OnSaveUserSettingsAtServer(ThisObject, Settings);
EndProcedure
